app/Http/Controllers/Usuario/UsuarioController.php

select * from `usuarios`
---
    public function index()
    {
        $usuarios = Usuario::all();