app/Http/Controllers/Producto/ProductoController.php

select * from `productos`
---
    public function index(Request $request){

        if( $request->is('api/*')){
        return $this->showAll(Producto::all());